CssAuthGuide/note/chapter1.md
- [第1章-CSS和文档](#sec-1)
  - [元素](#sec-1-1)
    - [替换和非替换元素](#sec-1-1-1)
    - [元素显示角色](#sec-1-1-2)
  - [结合CSS和XHTML](#sec-1-2)
    - [link标记](#sec-1-2-1)
    - [style元素](#sec-1-2-2)
    - [@import指令](#sec-1-2-3)
    - [内联样式](#sec-1-2-4)

# 第1章-CSS和文档<a id="sec-1"></a>

## 元素<a id="sec-1-1"></a>

### 替换和非替换元素<a id="sec-1-1-1"></a>

在CSS中， 元素通常有两种形式

-   替换元素: 指用来替换元素内容的部分并非由文档内容直接表示.
-   非替换元素: 指其内容由用户代理(通常是浏览器)在元素本身生成的框中显示.

### 元素显示角色<a id="sec-1-1-2"></a>

块级元素生成一个元素框, 它会填充其父元素的内容区, 旁边不能有其他元素.

-   元素框之前和之后生成了"分隔符".
-   常见的HTML块元素是 `p` 和 `div`

行内元素在一个文本行内生成元素框, 而不会打断这行文本.

-   元素框之前和之后不会生成了"分隔符".
-   常见的HTML行内元素是 `a` 和 `strong` 和 `em`

CSS的属性 `display` 的常用值有三个

-   `block`
-   `inline`
-   `list-item`

## 结合CSS和XHTML<a id="sec-1-2"></a>

### link标记<a id="sec-1-2-1"></a>

`link` 标记比较少用, 可以链接样式文档.

### style元素<a id="sec-1-2-2"></a>

`style` 元素包含样式表, 它在文档中单独出现.

开始和结束 `style` 标记之间的样式成为文档样式表, 或嵌套样式表.

可以使用 `@import` 指令包含多个外部样式表链接.

### @import指令<a id="sec-1-2-3"></a>

`@import` 用于指示Web浏览器加载一个外部样式表, 并在表现HTML文档时使用其样式.

`@import` 出现在 `style` 容器中, 它必须放在这里.

一个文档可以有多个 `@import` 语句, 会加载指定的多个外部样式表.

`@import` 指令在出现样式表中的其他规则之前.

### 内联样式<a id="sec-1-2-4"></a>

HTML元素的 `style` 属性可以设置一个内联样式, 内联样式不能使用 `@import`.
